app/Http/Controllers/ProdukBukuController.php

select count(*) as aggregate from `produk_bukus`
---
    public function index(BookIndexRequest $request)
    {
        $filters = $request->validated();
        $storeId = isset($filters['lokasi_toko_id'])
            ? (int) $filters['lokasi_toko_id']
            : null;

        $data_buku = ProdukBuku::listBooks()
            ->when($storeId, fn ($query, $id) => $query->filterStore($id))
            ->when($filters['status'] ?? null, fn ($query, $status) => $query
                ->filterAvailability($status, $storeId))
            ->when($filters['sorting'] ?? null, function ($query, $sorting) {
                return match ($sorting) {
                    'most', 'least' => $query->totalRate($sorting),
                    'rating_desc', 'rating_asc' => $query->averageRate($sorting),
                    'name_asc', 'name_desc' => $query->alphabet($sorting),
                    default => $query,
                };
            })
            ->when($filters['search'] ?? null, fn ($query, $search) => $query->search($search))
            ->paginate($filters['per_page'] ?? 5)
            ->withQueryString();

select * from `penulis_bukus` where `penulis_bukus`.`id` in (857)
select * from `produk_bukus` where `produk_bukus`.`id` = 1 limit 1
select `kategori_bukus`.*, `buku_kategori_pivot`.`produk_buku_id` as `pivot_produk_buku_id`, `buku_kategori_pivot`.`kategori_buku_id` as `pivot_kategori_buku_id` from `kategori_bukus` inner join `buku_kategori_pivot` on `kategori_bukus`.`id` = `buku_kategori_pivot`.`kategori_buku_id` where `buku_kategori_pivot`.`produk_buku_id` in (1)
---
    public function show(ProdukBuku $buku)
    {
        $buku = ProdukBuku::with(['penulisBuku', 'publisherBuku', 'kategoriBuku'])
            ->whereKey($buku->id)
            ->firstOrFail();